In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ser1 = Series(np.arange(3), index=['a', 'b', 'c'])
ser1

a    0
b    1
c    2
dtype: int64

In [4]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [6]:
dframe1 = DataFrame(np.arange(9).reshape(3, 3), index=['SF', 'LA','NY'], columns=['Pop', 'Size', 'Year'])
dframe1

    Pop  Size  Year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [7]:
dframe1.drop('LA')

    Pop  Size  Year
SF    0     1     2
NY    6     7     8

In [8]:
# Doesn't permanently affect the array
dframe1

    Pop  Size  Year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [10]:
# To permanently get rid of a row/column
dframe2 = dframe1.drop('LA')
dframe2

    Pop  Size  Year
SF    0     1     2
NY    6     7     8

In [11]:
# To drop a column
dframe1.drop('Year', axis=1)

    Pop  Size
SF    0     1
LA    3     4
NY    6     7